Revit 2027 API
PathOfTravel.SetWaypoint Method
 Updates the specified waypoint.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetWaypoint(
	XYZ waypoint,
	int index
)
Public Sub SetWaypoint (
	waypoint As XYZ,
	index As Integer
)
public:
void SetWaypoint(
	XYZ^ waypoint,
	int index
)
member SetWaypoint :
        waypoint : XYZ *
        index : int -> unit
Parameters
waypoint XYZ
 The new point for the waypoint.
index Int32
 The index of the waypoint to update.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Index refers to a non-existent waypoint. -or- This functionality is not available in Revit LT. -or- Cannot perform this operation for a path of travel in a group.
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace